let dDate = 7 * 24 * 60 * 60 * 1000; bDate = 1694811659365;

document.oncontextmenu = function () { return false };
document.getElementById("Priv").style.display = '';
document.getElementById("Resgic").style.display = 'none';
document.getElementById("Prog").style.display = 'none';
// localStorage.setItem(`yyy`, "1");
// localStorage.setItem(`Mds`, JSON.stringify(booolSA_MODS));
// QvSA = localStorage.getItem(`ZQvSA`);
let ZDialogSA = [false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false, false];
let mmmny = 0;
let pN = 1, NP = 2;
//localStorage.setItem(`ZZDialogSA`, JSON.stringify(ZDialogSA));

function Vhod() {
    if (localStorage.getItem(`yyy`) == "1") {
        let a = "";
        let b = 0;
        let now = Date.now();
        b = localStorage.getItem(`Ftime`) - now;
        b = Math.round(b / (1000 * 3600 * 24));
        if (now > localStorage.getItem(`Ftime`)) {
            a = "Время использования сайта закончилось, для использования функционала сайта, вам необходимо снова зарегистрироваться.";
            document.getElementById("Priv").style.display = 'none';
            document.getElementById("Resgic").style.display = '';
            document.getElementById("Prog").style.display = 'none';
            localStorage.setItem(`yyy`, "");
            Gen();
        } else {
            document.getElementById("Priv").style.display = 'none';
            document.getElementById("Resgic").style.display = 'none';
            document.getElementById("Prog").style.display = '';
            a = localStorage.getItem(`name`);
            a = "Здравствуйте " + a + ", сайт готов к использованию. Примерное время действия лицензии на использование сайта: " + b + " дней.";
            ZDialogSA = localStorage.getItem(`ZZDialogSA`);
            ZDialogSA = JSON.parse(ZDialogSA);
            mmmny = localStorage.getItem(`muny`);
            document.getElementById("mny").innerHTML = mmmny;
        }

        alert(a);
    } else {
        document.getElementById("Priv").style.display = 'none';
        document.getElementById("Resgic").style.display = '';
        document.getElementById("Prog").style.display = 'none';
        Gen();
        alert("Вас нет в базе данных пользователь, которым разрешено испольование сайта! Пройдите регистрацию.");
        localStorage.clear();
        localStorage.setItem(`ZZDialogSA`, JSON.stringify(ZDialogSA));
    }
}

function Gen() {
    let a = "";
    let b = 0;
    b = (Math.random() * 11111);
    a = String(Math.round(b));
    document.getElementById("qvest").innerHTML = a;
}

function Prov() {
    let a = document.getElementById("qvest").innerHTML;
    let e = document.getElementById("Vtext").value;
    let b = 0, c = 0, d = 0;
    b = Number(a);
    c = b / 1000;
    d = b / 43;
    b = Math.round(Math.log10(b));
    c = Math.round(Math.exp(c));
    d = Math.round(Math.log2(d));
    a = String(b) + String(d) + String(c);
    if (a == e) {
        alert("Вы прошли проверку!");
        localStorage.setItem(`muny`, 100);
        ZDialogSA = localStorage.getItem(`ZZDialogSA`);
        ZDialogSA = JSON.parse(ZDialogSA);
        mmmny = localStorage.getItem(`muny`);
        document.getElementById("mny").innerHTML = mmmny;
        a = prompt("Как к вам обращаться? (Введите полное имя)");
        if (a == "") {
            alert("Вы ничего не написали, тогда ваше имя будет Кеша!");
            а = "Кеша";
            localStorage.setItem(`name`, "Кеша");
        } else {
            localStorage.setItem(`name`, a);
        }

        let now = Date.now();
        now = now + (21 * 24 * 3600 * 1000);

        localStorage.setItem(`Ftime`, now);
        localStorage.setItem(`yyy`, "1");
        document.getElementById("Priv").style.display = 'none';
        document.getElementById("Resgic").style.display = 'none';
        document.getElementById("Prog").style.display = '';
    } else {
        alert("You are not welcome here! Сайт ждал от вас другой ответ, введите верное число!");
        Gen();
    }

}

function prakt() {
    let a = `На данный момент времени, автор не несёт ответственности за правильность решения задач!`, b = ``;
    let now = Date.now();
    if (now > bDate) {
        b = `
<div class="cent">
<img src="img/z1.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 16.09.23г.
</div>
`;
    }

    a = a + `<hr>
1.13. В ткани массой m = 10 г поглощается 10^9 α-частиц с энергией Е = 5 МэВ. Найти эквивалентную дозу. Коэффициент качества для α-частиц K = 20.` + b;

    if (now > bDate) {
        b = `
<div class="cent">
<img src="img/z2.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 16.09.23г.
</div>
`;
    }

    a = a + `<hr>
2.14. Мощность экспозиционной дозы γ-излучения на расстоянии r = 0,1 м от точечного источника составляет Nr = 3 Р/час. Определить минимальное расстояние от источника, на котором можно ежедневно работать по 6 ч без защиты. ПД = 20 мЗв/год. Поглощение γ-излучения воздухом не учитывать.
` + b;

    if (now > bDate + 2 * dDate) {
        b = `
<div class="cent">
<img src="img/z4.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 30.09.23г.
</div>
`;
    }

    a = a + `<hr>
3. нет решения. <hr>
4.16. Средняя мощность экспозиционной дозы излучения в рентгеновском кабинете равна 6,45∙10–12 Кл/ (кг∙с). Врач находится в течение дня 5 ч в этом кабинете. Какова его доза облучения за 6 рабочих дней?
` + b;

    if (now > bDate + 2 * dDate) {
        b = `
<div class="cent">
<img src="img/z5.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 30.09.23г.
</div>
`;
    }

    a = a + `<hr>
5.17. Телом массой m = 60 кг в течении t = 6 часов была поглощена энергия Е = 1 Дж. Найдите поглощенную дозу и мощность поглощенной дозы в единицах СИ и во внесистемных единицах.
` + b;

    if (now > bDate + 4 * dDate) {
        b = `
<div class="cent">
<img src="img/z6.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 14.10.23г.
</div>
`;
    }

    a = a + `<hr>
6. Некая модель тела человека подверглась гамма-излучению в 500 Р. Масса модели 50 кг. Удельная теплоемкость 4,2*10^3 Дж/кг. Считая, что вся энергия идет на нагревание, найти на сколько увеличится температура модели.
` + b;

    if (now > bDate + 4 * dDate) {
        b = `
<div class="cent">
<img src="img/z7.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 14.10.23г.
</div>
`;
    }

    a = a + `<hr>
7. Найти удельную активность 131I с периодом полураспада 8 суток.
` + b;

    if (now > bDate + 6 * dDate) {
        b = `
<div class="cent">
<img src="img/z9.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 28.10.23г.
</div>
`;
    }

    a = a + `<hr>
           8. нет решения.
<hr>
9. Мощность дозы γ-излучения на расстоянии 50 см от точечного источника составляет 0,1 Р/мин. Сколько времени в течение рабочего дня можно находиться на расстоянии 10 м от источника, если предельно допустимая доза за рабочий день не должна превышать 17 мР? ` + b;

    if (now > bDate + 6 * dDate) {
        b = `
<div class="cent">
<img src="img/z12.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 28.10.23г.
</div>
`;
    }

    a = a + `<hr>
10. нет решения.
<hr>
11. нет решения.
<hr>
12.24. Изотоп 6C14 испытывает радиоактивный распад. Масса изотопа m = 1 г. Рассчитать начальное количество ядер N0, число распавшихся ядер ΔN, а также долю распавшихся ядер (в %) за время t1 = 4∙10^3 лет, если период полураспада изотопа Т1⁄2 = 5570 лет.` + b;


    if (now > bDate + 8 * dDate) {
        b = `
<div class="cent">
<img src="img/z18.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 11.11.23г.
</div>
`;
    }

    a = a + `<hr>
18. Первоначальная масса радиоактивного изотопа йода 53/131I 1г (Т1/2 = 8 суток). Определите начальную активность и активность через 3 суток.` + b;

    if (now > bDate + 8 * dDate) {
        b = `
<div class="cent">
<img src="img/z19.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 11.11.23г.
</div>
`;
    }

    a = a + `<hr>
19. Определите удельную активность 238U92 Т1/2 = 4,5 * 10^9 лет.` + b;

    if (now > bDate + 10 * dDate) {
        b = `
<div class="cent">
<img src="img/z20.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 25.11.23г.
</div>
`;
    }

    a = a + `<hr>
20. Активность некого препарата уменьшилась в 250 раз. Скольким периодам полураспала равен протекший период.` + b;

    if (now > bDate + 10 * dDate) {
        b = `
<div class="cent">
<img src="img/z21.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 25.11.23г.
</div>
`;
    }

    a = a + `<hr>
21. Начальная активность 1г изотопа 88Ra226равна 1 Ки. Определите Т1/2.` + b;

    if (now > bDate + 12 * dDate) {
        b = `
<div class="cent">
<img src="img/z22.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 9.12.23г.
</div>
`;
    }

    a = a + `<hr>
22.23. Найти начальную удельную активность тория 90Th229, если период полураспада его составляет 2,2·10^11 с.
` + b;

    if (now > bDate + 12 * dDate) {
        b = `
<div class="cent">
<img src="img/z25.webp" alt="" width="60%">
</div>
`;
    } else {
        b = `
<div class="cent">
Будет доступно 9.12.23г.
</div>
`;
    }

    a = a + `<hr>
25. Какая доля радиоактивных ядер распадается за месяц, если его период полураспада 71.3 дня.
           ` + b;

    document.getElementById("boed1").innerHTML = a;
}

function Dopm() {
    let a = 0, b = 0, c = 0, d = 0;
    let tte = "";
    b = (Math.random() * 13571);
    if ((pN != 1) && (NP > 0)) {
        a = pN;
    } else {
        a = Math.round(b);
        NP = 2;
        pN = a;
    }

    let age = prompt('Чтобы повысить баланс монет знаний ( на 100 монет ), договоритесь с раработчиком и передайте ему число снизу, он вам скажет другое число, которым нужно заменить число снизу.', a);
    b = a;
    c = b / 1000;
    d = b / 43;
    b = Math.round(Math.log10(b));
    c = Math.round(Math.exp(c));
    d = Math.round(Math.log2(d));
    tte = String(b) + String(d) + String(c);
    if (tte == String(age)) {
        a = Number(mmmny);
        mmmny = a + 100;
        localStorage.setItem(`muny`, mmmny);
        document.getElementById("mny").innerHTML = mmmny;
        alert("Баланс монет знаний пополнен!")
        NP = 2;
        pN = 1;
    } else {
        NP = NP - 1;
    }
}

function pract1() {
    let a = `<hr>На данный момент времени, автор не несёт ответственности за правильность ответов и как именно вы будете отвечать! <br>
    Изложенные в данном разделе ответы на экаменационные вопросы, написаны опираясь на лекционные знания, большой перечень литературных источников и в основном на моё понимание той или иной темы. То как бы я отвечал на экзамене. <hr>`, b = ``;
    b = `
    <div class="butOk" onclick="Vop1()">
    Излучение. Энергия разных видов излучения 🔑
    </div>
    <div class="butOk" onclick="Vop2()">
    Строение ядра. Ядерные реакции 🔑
    </div>
    <div class="butOk" onclick="Vop3()">
    Радиоактивный распад. Альфа-распад 🔑
    </div>
    <div class="butOk" onclick="Vop4()">
    Радиоактивный распад. Бета-распад 🔑
    </div>
    <div class="butOk" onclick="Vop5()">
    Радиоактивный распад. Позитронный распад 🔑
    </div>
    <div class="butOk" onclick="Vop6()">
    Радиоактивный распад. Гамма-распад 🔑
    </div>
    <div class="butOk" onclick="Vop7()">
    Закон радиоактивного распада. Активность 🔑
    </div>
    <div class="butOk" onclick="Vop8()">
    Взаимодействие фотонов с веществом. Релеевское рассеяние. 🔑
    </div>
    <div class="butOk" onclick="Vop9()">
    Взаимодействие фотонов с веществом. Томсоновоское рассеяние 🔑
    </div>
    <div class="butOk" onclick="Vop10()">
    Комптоновское рассеяние 💠
    </div>
    <div class="butOk" onclick="Vop11()">
    Фотоэлектрическое поглощение 🔑
    </div>
    <div class="butOk" onclick="Vop12()">
    Образование электронно-позитронных пар 💠
    </div>
    <div class="butOk" onclick="Vop13()">
    Фотоядерные реакции 🔑
    </div>
    <div class="butOk" onclick="Vop14()">
    Взаимодействия нейтронов с веществом 🔑
    </div>
    <div class="butOk" onclick="Vop15()">
    Взаимодействие тяжелых заряженных частиц с веществом 🔑
    </div>
    <div class="butOk" onclick="Vop16()">
    Взаимодействие электронов с веществом 💠
    </div>
    <div class="butOk" onclick="Vop17()">
    Поглощенная доза 🔑
    </div>
    <div class="butOk" onclick="Vop18()">
    Электронное равновесие 🔑
    </div>
    <div class="butOk" onclick="Vop19()">
    Пик Брэгга 💠
    </div>
    <div class="butOk" onclick="Vop20()">
    Базовые дозовые характеристики излучения в веществе 💠
    </div>
    <div class="butOk" onclick="Vop21()">
    Эффект Ожэ 🔑
    </div>
    <div class="butOk" onclick="Vop22()">
    Экспозиционная доза. Линейная передача энергии 🔑
    </div>
    <div class="butOk" onclick="Vop23()">
    Керма. Керма фотонного излучения. Керма нейтронного излучения 🔑
    </div>
    <div class="butOk" onclick="Vop24()">
    Относительная биологическая эффективность. Величины характеризующие  качество излучения. ОБЭ для стохастических и детерминированных эффектов 🔑
    </div>
    <div class="butOk" onclick="Vop25()">
    Эквивалентная доза. Взвешивающий коэффициент излучения 🔑
    </div>
    <div class="butOk" onclick="Vop26()">
    Эффективная доза 🔑
    </div>
    <div class="butOk" onclick="Vop27()">
    Газонаполненный детектор. ВАХ газонаполненного детектора 🔑
    </div>
    <div class="butOk" onclick="Vop28()">
    Ионизационная камера. Чувствительность детектора. Ионизационный ток и плотность ионов 🔑
    </div>
    <div class="butOk" onclick="Vop29()">
    Конструкция ИК. Токовые ИК. Импульсные ИК 🔑
    </div>
    <div class="butOk" onclick="Vop30()">
    Пропорциональный счетчик. Явление газового усиления. Коэффициент газового усиления 🔑
    </div>
    <div class="butOk" onclick="Vop31()">
    Счетчик Гейгера-Мюллера. Прекращение разряда в счетчике Г-М. Самогасящиеся и несамогасящиеся счетчики. Основные характеристики счетчика 🔑
    </div>
    <div class="butOk" onclick="Vop32()">
    Счетчик Вавилова Черенкова. Излучение Вавилова-Черенкова. Принцип работы счетчика.  Типы черенковских счетчиков 💠
    </div>
    <div class="butOk" onclick="Vop33()">
    Сцинтилляционный детектор. Сцинцилляторы. Процесс сцинцилляции в кристаллических структурах. Качества и характеристики сцинциллятора. Кристалл NaI(Tl) 🔑
    </div>
    <div class="butOk" onclick="Vop34()">
    ФЭУ сцинтилляционного метода. Электроника сцинтилляционого метода 💠
    </div>
    <div class="butOk" onclick="Vop35()">
    Спектрометрия с NaI(Tl). Амплитудное распределение импульсов при спектометрии 🔑
    </div>
    <div class="butOk" onclick="Vop36()">
    Полупроводниковый детектор 🔑
    </div>
    <br><hr>
    <div id="OTv" class="just noselect">
    Ответ на вопрос билета.
    </div>
    `

    a = a + b;
    document.getElementById("boed1").innerHTML = a;
}

function Vop(numV) {
    let tY = false;
    numV = numV - 1;
    if (ZDialogSA[numV]) {
        tY = true;
    } else {
        if (mmmny < 9) {
            alert("У вас недостаточно монет знаний, договоритель с разработчиком.")
        } else {
            let a = "Стоимость просмотра/получения ответа 10 монет знаний, у вас есть: " + String(mmmny) + ", хотите их потратьть?";
            let isBoss = confirm(a);
            if (isBoss) {
                mmmny = mmmny - 10;
                ZDialogSA[numV] = true;
                tY = true;
                localStorage.setItem(`muny`, mmmny);
                document.getElementById("mny").innerHTML = mmmny;
                localStorage.setItem(`ZZDialogSA`, JSON.stringify(ZDialogSA));
            }
        }
    }

    return tY
}

function Vop1() {
    let a = 1, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Излучение. Энергия разных видов излучения 
        <br>   Излучение является формой энергии в движении через пространство и время.
        <br>   Лично в моём понимании, излучении это поток частиц, приводящий к ионизации среды, испущенный радионуклидом при распаде ядер, термо(-электронной) эмиссии (инжекции), аннигиляции других частиц, при рассеивании(торможении) на мишени, непосредственное возбуждение атома с последующим испусканием характеристического излучения. Например, так называемая энергия ионизации, необходимая для вырывания электрона с атомных орбиталей за её пределы у атома водорода составляет 13.8 эВ (с нижнего уровня), соответственно для вышестоящих уровней она меньше (для внешнего уровня минимальна). Если предположить, что облучаемая среда однородна, то частица с большей энергией будет ионизировать её сильнее, и сначала должна поглощать энергию внешняя орбита, а затем ниже расположенные (что логично), но в зависимости от вида излучения, точнее природы, в ход вступает некая вероятностная характеристика влияющая на процесс ионизации (это рассеивание/поглощение, линейное ослабление (пик Брэга), выбивание электронов сначала с нижестоящих орбит и переилучение (Оже) и т.д).
        <br>   Глобально разделяют частицы которые имеют заряд (альфа, бета, протоны, адроны (барионы), тяжёлые частицы (нуклоны), нейтрино) и не имеют нейтроны, фотоны (Ультрафиолетовая радиация, рентгеновские и гамма лучи в общем составляющие электромагнитное излучение) и адроны(мезоны). Непосредственно ионизирующие и косвенно ионизирующие.
        <br>   Ограничения на максимальную энергию излучения нет (физически не доказан верхний предел энергии, которую может переносить частица), например, существуют такие космические объекты как квазары или пульсары (одни из возможных этапов эволюции звёзд), из полюсов которых вырывается излучение колоссальной энергии, способное практически мгновенно стерилизовать планету (хотя тихоходки (микроорганизмы) могут выжить), но поблизости к солнечной системе таких нет. 
        <br>   Что касается нижней границы, то в большинстве источников используется значение 10 эВ, что вполне достаточно для разрыва хим. связей в органических молекулах (метан в радикал CH3- и Н+). 
        <br>   Непосредственное действие излучения оказывает как энергия, так и проникающая способность, например, посветив белым фонариком через палец, красный свет проходит через кожу лучше, чем другой свет, аналогично красное небо при закате (красный свет меньше рассеивается нежели остальные), что в свою очередь зависит от среды распространения излучения.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop2() {
    let a = 2, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Строение ядра. Ядерные реакции
        <br>   Первую модель строения атома придумал Томсон под названием «пудинг с изюмом» (удостоенный Нобелевской премии за открытие электрона), но в конечном счёте она оказалась неверной.
        <br>   Планетарная модель атома Резерфорда: в целом атом нейтрален, в центре атома расположено положительно заряжённое ядро, в котором сосредоточена почти вся масса атома, электроны движутся по орбитам вокруг ядра, заряд ядра, как и число электронов в атоме, равен порядковому номеру элемента в таблице Менделеева.
        <br>   Ядерные реакции возникают по двум механизмам, при распаде (естественном, например радиоактивная руда с содержанием урана) и при добавлении частицы из вне (вынужденная реакция). Во всех ядерных реакциях выполняются законы сохранения ряда физических величин, в частности, заряда, массы и энергии.
        <br>   Налетающая частица инициирует один из трех возможных видов взаимодействия.
        упругое рассеяние, в результате которого налетающая частица a изменяет направление своего движения и кинетическую энергию.
        неупругое рассеяние, при котором налетающая частица входит в ядро, а затем она (или такая же) испускается ядром, но уже с меньшей энергией и в другом направлении.
        <br>   Активность A(t) радиоактивного вещества (радионуклида) в момент времени t определяется как произведение постоянной распада λ и числа радиоактивных ядер N(t), т.е. A(t)= λN(t)
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop3() {
    let a = 3, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Радиоактивный распад. Альфа-распад
        <br>   Естественная радиоактивность — самопроизвольный распад атомных ядер, встречающихся в природе.

        <br>   Искусственная радиоактивность — самопроизвольный распад атомных ядер, полученных искусственным путём через соответствующие ядерные реакции.
        Радиоактивный распад характеризуется временем жизни радиоактивного изотопа, типом испускаемых частиц, их энергиями.
        Основными видами радиоактивного распада являются:
    
        <br>   α-распад – испускание атомным ядром α-частицы;
        <br>   β-распад – испускание атомным ядром электрона и антинейтрино, позитрона и нейтрино, поглощение ядром атомного электрона с испусканием нейтрино;
        <br>   γ-распад – испускание атомным ядром γ-квантов;
        <br>   спонтанное деление – распад атомного ядра на два осколка сравнимой массы (+ отдельные нейтроны).
        <br>   Во  всех  видах  радиоактивности   (кроме γ-распада) изменяется состав ядра – число протонов Z, массовое
число A или и то и другое одновременно.
<br>   Изомеры - долгоживущие возбужденные состояния атомных ядер. Сочетание высокой мультипольности и малой энергии переходов обуславливает существование состояний с большими периодами полураспада, которые могут составлять годы. У изотопа может быть несколько изомерных уровней.
<br>   Период полураспада T1/2 – время, за которое первоначальное количество радиоактивных ядер уменьшается в два раза:

<br>   T1/2 = ln2/λ=0.693/λ
<br>   Постоянная распада λ − вероятность распада ядра в единицу времени. Если в образце в момент времени t имеется N радиоактивных ядер, то количество ядер dN, распавшихся за время dt, пропорционально N, λи интервалу времени наблюдений dt:

<br>   dN = –λNdt.

<br>   Знак «–» означает, что число радиоактивных ядер в образце в результате распада уменьшается.
<br>   Закон радиоактивного распада имеет вид:

<br>   N(t) = N0e-λt.

<br>   Естественный радиационный фон является неотъемлемым фактором окружающей среды, таким же как, например, гравитация и электромагнитные поля. Все живые организмы развиваются в условиях постоянного воздействия естественной радиации.

<br>   Характеризует вес и химически нестабильные ядра. В процессе распада ядро теряет два протона и столько же нейтронов, в результате чего его атомный номер уменьшается на две единицы, а массовое число — на четыре единицы. В результате этого превращения образуется атом гелия. Излучавшее ядро называется первичным ядром, а ядро, образовавшееся в процессе распада, — ядром-потомком. Основная запись радиоактивного распада альфа-типа может быть представлена как

<br>   В такой записи первый член, т. е. , является первичным ядром, а ядром-потомком есть , тогда как  — это альфа-частица.

<br>   Примером альфа-распада может служить превращение изотопа урана 238U, в ходе которого его атомный номер уменьшается на два. 

    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop4() {
    let a = 3, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Радиоактивный распад. Бета- Позитронный распад
        <br>   Естественная радиоактивность — самопроизвольный распад атомных ядер, встречающихся в природе.

        <br>   Искусственная радиоактивность — самопроизвольный распад атомных ядер, полученных искусственным путём через соответствующие ядерные реакции.
        Радиоактивный распад характеризуется временем жизни радиоактивного изотопа, типом испускаемых частиц, их энергиями.
        Основными видами радиоактивного распада являются:
    
        <br>   α-распад – испускание атомным ядром α-частицы;
        <br>   β-распад – испускание атомным ядром электрона и антинейтрино, позитрона и нейтрино, поглощение ядром атомного электрона с испусканием нейтрино;
        <br>   γ-распад – испускание атомным ядром γ-квантов;
        <br>   спонтанное деление – распад атомного ядра на два осколка сравнимой массы (+ отдельные нейтроны).
        <br>   Во  всех  видах  радиоактивности   (кроме γ-распада) изменяется состав ядра – число протонов Z, массовое
число A или и то и другое одновременно.
<br>   Изомеры - долгоживущие возбужденные состояния атомных ядер. Сочетание высокой мультипольности и малой энергии переходов обуславливает существование состояний с большими периодами полураспада, которые могут составлять годы. У изотопа может быть несколько изомерных уровней.
<br>   Период полураспада T1/2 – время, за которое первоначальное количество радиоактивных ядер уменьшается в два раза:

<br>   T1/2 = ln2/λ=0.693/λ
<br>   Постоянная распада λ − вероятность распада ядра в единицу времени. Если в образце в момент времени t имеется N радиоактивных ядер, то количество ядер dN, распавшихся за время dt, пропорционально N, λи интервалу времени наблюдений dt:

<br>   dN = –λNdt.

<br>   Знак «–» означает, что число радиоактивных ядер в образце в результате распада уменьшается.
<br>   Закон радиоактивного распада имеет вид:

<br>   N(t) = N0e-λt.

<br>   Естественный радиационный фон является неотъемлемым фактором окружающей среды, таким же как, например, гравитация и электромагнитные поля. Все живые организмы развиваются в условиях постоянного воздействия естественной радиации.
<br>   Бета- Позитронный распад может происходить двумя способами — с испусканием электронов или позитронов. Их заряды противоположны, но массы одинаковы, поэтому иногда позитрон называют антиэлектроном. При рассмотрении бета-радиоактивного распада обычно использовалась модель связанной в ядре молекулы (электрона или позитрона), которая вылетает из ядра во время распада.
<br>   Электрон, записанный как , имеет массовое число, равное 0, и атомный номер. Это означает, что он является практически безмассовой частицей с отрицательным зарядом. У протона оба числа равны единице. Присутствие нейтрино (v) необходимо в силу закона сохранения энергии и импульса. Такие преобразования, происходящие в ядре, приводят к слабым ядерным взаимодействиям. 
    `
    }
    document.getElementById("OTv").innerHTML = b;
}

function Vop5() {
    let a = 3, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Радиоактивный распад. Бета- Позитронный распад
        <br>   Естественная радиоактивность — самопроизвольный распад атомных ядер, встречающихся в природе.

        <br>   Искусственная радиоактивность — самопроизвольный распад атомных ядер, полученных искусственным путём через соответствующие ядерные реакции.
        Радиоактивный распад характеризуется временем жизни радиоактивного изотопа, типом испускаемых частиц, их энергиями.
        Основными видами радиоактивного распада являются:
    
        <br>   α-распад – испускание атомным ядром α-частицы;
        <br>   β-распад – испускание атомным ядром электрона и антинейтрино, позитрона и нейтрино, поглощение ядром атомного электрона с испусканием нейтрино;
        <br>   γ-распад – испускание атомным ядром γ-квантов;
        <br>   спонтанное деление – распад атомного ядра на два осколка сравнимой массы (+ отдельные нейтроны).
        <br>   Во  всех  видах  радиоактивности   (кроме γ-распада) изменяется состав ядра – число протонов Z, массовое
число A или и то и другое одновременно.
<br>   Изомеры - долгоживущие возбужденные состояния атомных ядер. Сочетание высокой мультипольности и малой энергии переходов обуславливает существование состояний с большими периодами полураспада, которые могут составлять годы. У изотопа может быть несколько изомерных уровней.
<br>   Период полураспада T1/2 – время, за которое первоначальное количество радиоактивных ядер уменьшается в два раза:

<br>   T1/2 = ln2/λ=0.693/λ
<br>   Постоянная распада λ − вероятность распада ядра в единицу времени. Если в образце в момент времени t имеется N радиоактивных ядер, то количество ядер dN, распавшихся за время dt, пропорционально N, λи интервалу времени наблюдений dt:

<br>   dN = –λNdt.

<br>   Знак «–» означает, что число радиоактивных ядер в образце в результате распада уменьшается.
<br>   Закон радиоактивного распада имеет вид:

<br>   N(t) = N0e-λt.

<br>   Естественный радиационный фон является неотъемлемым фактором окружающей среды, таким же как, например, гравитация и электромагнитные поля. Все живые организмы развиваются в условиях постоянного воздействия естественной радиации.
<br>   Бета- Позитронный распад может происходить двумя способами — с испусканием электронов или позитронов. Их заряды противоположны, но массы одинаковы, поэтому иногда позитрон называют антиэлектроном. При рассмотрении бета-радиоактивного распада обычно использовалась модель связанной в ядре молекулы (электрона или позитрона), которая вылетает из ядра во время распада.
<br>   Электрон, записанный как , имеет массовое число, равное 0, и атомный номер. Это означает, что он является практически безмассовой частицей с отрицательным зарядом. У протона оба числа равны единице. Присутствие нейтрино (v) необходимо в силу закона сохранения энергии и импульса. Такие преобразования, происходящие в ядре, приводят к слабым ядерным взаимодействиям.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop6() {
    let a = 3, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Радиоактивный распад. гамма
        <br>   Естественная радиоактивность — самопроизвольный распад атомных ядер, встречающихся в природе.

        <br>   Искусственная радиоактивность — самопроизвольный распад атомных ядер, полученных искусственным путём через соответствующие ядерные реакции.
        Радиоактивный распад характеризуется временем жизни радиоактивного изотопа, типом испускаемых частиц, их энергиями.
        Основными видами радиоактивного распада являются:
    
        <br>   α-распад – испускание атомным ядром α-частицы;
        <br>   β-распад – испускание атомным ядром электрона и антинейтрино, позитрона и нейтрино, поглощение ядром атомного электрона с испусканием нейтрино;
        <br>   γ-распад – испускание атомным ядром γ-квантов;
        <br>   спонтанное деление – распад атомного ядра на два осколка сравнимой массы (+ отдельные нейтроны).
        <br>   Во  всех  видах  радиоактивности   (кроме γ-распада) изменяется состав ядра – число протонов Z, массовое
число A или и то и другое одновременно.
<br>   Изомеры - долгоживущие возбужденные состояния атомных ядер. Сочетание высокой мультипольности и малой энергии переходов обуславливает существование состояний с большими периодами полураспада, которые могут составлять годы. У изотопа может быть несколько изомерных уровней.
<br>   Период полураспада T1/2 – время, за которое первоначальное количество радиоактивных ядер уменьшается в два раза:

<br>   T1/2 = ln2/λ=0.693/λ
<br>   Постоянная распада λ − вероятность распада ядра в единицу времени. Если в образце в момент времени t имеется N радиоактивных ядер, то количество ядер dN, распавшихся за время dt, пропорционально N, λи интервалу времени наблюдений dt:

<br>   dN = –λNdt.

<br>   Знак «–» означает, что число радиоактивных ядер в образце в результате распада уменьшается.
<br>   Закон радиоактивного распада имеет вид:

<br>   N(t) = N0e-λt.

<br>   Естественный радиационный фон является неотъемлемым фактором окружающей среды, таким же как, например, гравитация и электромагнитные поля. Все живые организмы развиваются в условиях постоянного воздействия естественной радиации.
<br>   Гамма-распад — это термин, применяемый для описания распада, который происходит, когда возбужденное ядро переходит в состояние с более низкой энергией, что приводит к испусканию фотонов. Этот переход аналогичен переходу электронов на более низкие энергетические уровни и может быть записан символически, где * обозначает возбужденное состояние. При гамма-распаде не происходит изменения массового числа или атомного номера. Единственным изменением является тип ядра.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop7() {
    let a = 7, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   Особо нечего добавить, зависимость числа (не)распавшихся ядер подобна распределению в законе Мальтуса. 
        <br>   Радиоактивный распад является принципиально статистическим явлением. Нельзя
предсказать, в какой момент времени распадется то или иное возбужденное ядро. Но можно с
высокой степенью точности указать, какая часть нестабильных ядер распадется за определенный промежуток времени. Выявляемые в радиоактивном распаде закономерности носят вероятностный характер и выполняются тем точнее, чем более велико число радиоактивных ядер.
<br>   Пусть в момент времени t имеется N одинаковых радиоактивных ядер. Будем считать,
что ядра распадаются независимо друг от друга. Обозначим через λ вероятность распада ядра в
единицу времени - эта величина называется постоянной распада. Смысл λ заключается в том,
что из N нестабильных ядер в единицу времени распадается в среднем λN ядер.
        <br>   Закон радиоактивного распада имеет вид:

<br>   N(t) = N0e-λt.
<br>   Радиоактивность – это способность ядер атомов некоторых химических элементов разрушаться, видоизменяться с испусканием атомных, субатомных частиц, гамма-квантов.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop8() {
    let a = 8, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Существует два глобальных типа взаимодействия, упругое и неупругое.
        <br>   К упругому относят релеевское рассеивание.
        <br>   К неупругому комптоновское и при полном поглощении фотоэлектрическое(фотопоглощение), также отдельно рассматривается в спектроскопия комбинационного рассеивания.
        <br>   Также возможно разделение на взаимодействия, в которых частица поглощается (полностью передает свою энергию) это фотоэффект (фотопоглощение и образование пар) и соответственно без её исчезновения это релеевское и комптоновское.
        <br>   Релеевсое рассеяние: упруго рассеяния фотона на пространственно распределенном ансамбле электронов, таких как, например, атомные электроны, находящиеся на орбитах вокруг ядра.
        <br>   В этом случае появляется возможность интерференции волн,
        рассеянных различными электронами. Процесс является упругим в
        том смысле, что фотоны теряют при этом пренебрежимо малую
        долю своей энергии, атом же получает некоторый импульс отдачи
        для выполнения законов сохранения. 
        <br>   Поскольку передаваемый импульс мал и поглощается всем атомом, то частота падающего и
        рассеянного излучения практически совпадают. Этот процесс взаимодействия фотонов называется релеевским рассеянием. 
        <br>   Фотоны или γ-излучение принято разделять в зависимости от способа их образования на следующие виды: • характеристическое излучение (или х-лучи), образующееся в результате перехода орбитальных электронов на другую орбиту атома; • тормозное излучение (или х-лучи), являющееся результатом кулоновского взаимодействия электронов с ядрами атомов; • фотоны (или γ-кванты), образующиеся при ядерных превращениях; • аннигилляционное излучение (или аннилилляционные кванты), образующееся при аннигиляции позитрона с электроном.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop9() {
    let a = 9, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Томсоновское рассеяние: описывает упругое рассеяние фотона на одиночном электроне.
        <br>   Томсоновское рассеяние является упругим взаимодействием
между фотоном, проявляющим себя как классическая электромагнитная волна, и "свободным" электроном, при котором электрон
испытывает осциллирующие колебания и не происходит передачи
энергии от фотона электрону. В реальности электрон не является,
строго говоря, свободным, так как если он свободен от связи с атомом, то может быть связан, например, внутри кристаллической решетки. В результате импульс отдачи разделяется с атомом, и поэтому им можно пренебречь. Осциллирующий электрон излучает
электромагнитную энергию с такой же частотой, как и у падающей
волны, и угловым распределением электрического диполя. 

<br>   Фотоны или γ-излучение принято разделять в зависимости от способа их образования на следующие виды: • характеристическое излучение (или х-лучи), образующееся в результате перехода орбитальных электронов на другую орбиту атома; • тормозное излучение (или х-лучи), являющееся результатом кулоновского взаимодействия электронов с ядрами атомов; • фотоны (или γ-кванты), образующиеся при ядерных превращениях; • аннигилляционное излучение (или аннилилляционные кванты), образующееся при аннигиляции позитрона с электроном.
<br>   В реальности электрон не является, строго говоря, свободным, так как если он свободен от связи с атомом, то может быть связан, например, внутри кристаллической решетки. В результате импульс отдачи разделяется с атомом, и поэтому им можно пренебречь.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop10() {
    let a = 10, b = "(0_0)";
    let result = true;
    //result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Комптоновское рассеяние.(материала лекции достаточно)
        <br>   Томсоновское и релеевское рассеяния представляют классические электродинамические процессы, в которых не происходит передачи энергии в вещество. <br>   Комптоновское рассеяние (или эффект Комптона), напротив, является квантовым электродинамическим
        взаимодействием, приводящим к прямой передаче энергии от фотона электрону отдачи. 
        <br>   Изменения длины волны λ*–λв длинноволновую сторону спектра при рассеянном излучении получило название комптоновского смещения , а само явление –эффект Комптона.
        <br>   Возможно образование нескольких фотонов с изменённой длиной волны.
        <br>   Эффект комптона является обратимым, при обратном эффекте  электроны движутся со скоростями, близкими к скорости света), то при упругом рассеянии длина волны излучения будет уменьшаться, то есть энергия (и импульс) фотонов будет увеличиваться за счет энергии (и импульса) электронов. 
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop11() {
    let a = 11, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        (дополнение к лекции)
        Другими словами фотоэффект, и общего курса физики для такого поглощения необходима минимальная энергия эквивалентная работе выхода. Возможно, что энергия фотона передается без излучательным путём, в виде вырывания электрона с внешних орбит. (отдельно Ожэ эффект) , но чаще всего происходит пере излучение фотона в виде характеристического излучения (отдельно Рамановская спектроскопия).
        <br>   К процессам взаимодействия в рассматриваемой области энергий, в которых первичный фотон поглощается, по факту относятся фотоэлектрическое поглощение, эффект образования электронно-позитронных пар и фотоядерные реакции.
        <br>   В силу того, что фотон является бозоном, а электрон фермионом, то при взаимодействии фотона с атомным электроном становится возможным полное поглощение фотона. Этот вид взаимодействия называется фотоэлектрическим поглощением, или короче
фотоэффектом. Он имеет особо важное значение при низких энергиях падающих фотонов и для веществ с большим Z. 
Следует подчеркнуть, что фотоэлектрическое поглощение является реакцией трех тел (падающий фотон, атомный электрон и атом), поэтому она невозможна со свободным электроном, потому что для выполнения закона сохранения импульса требуется наличие третьего тела, которому передается импульс отдачи. Однако так как масса атома очень большая по сравнению с массой электрона, то кинетическая энергия отдачи атома пренебрежимо мала.
<br>   Электронные вакансии, образующиеся на оболочках атома в результате фотоэффекта, приводят к переходу атома из основного в возбужденное состояние, характеризующееся более высоким уровнем энергии.
<br>   Снятие возбуждения происходит различными способами, которые можно разделить на две категории в зависимости от того, испускается (вылетают фотоны) или нет при этом электромагнитное излучение (вылет Ожэ электрона).
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop12() {
    let a = 12, b = "(0_0)";
    let result = true;
    //result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Данный эффект подробно описан в лекциях (добавить особо нечего). Наблюдается при энергиях больше одного МЭВ. Наблюдается в камере Вильсона.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop13() {
    let a = 13, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        (дополнение к лекции)
        <br>   Все фотоядерные реакции являются эндоэнергетическими и поэтому пороговыми. Значение пороговой энергии равно энергии
        связи частиц, которые испускаются при поглощении фотона ядром. 
        <br>   Особенностью зависимости поперечного сечения фотоядерной
реакции (гамма-нейтрон) от энергии первичного фотона является наличие большого максимума с шириной Г не менее нескольких МэВ, который
называют гигантским резонансом.
<br>   Абсолютная величина сечения фотоядерных реакций растет почти линейно с увеличением атомного веса вещества, однако в рассматриваемой области энергий эти реакции не оказывают заметного влияния на ослабление фотонов и значения дозовых характеристик поля.
Относительно странной картинки:
<br>   Оказалось, что этот резонанс является наиболее сильной реакцией атомных ядер на электромагнитное излучение и представляет собой универсальное и фундаментальное ядерное возбуждение. Оно присуще всем ядрам.
<br>   В сечении поглощения фотонов атомными ядрами σγ можно выделить четыре основные энергетические области, они обозначены цифрами I, II, III, IV.
<br>   Фотон, поглощаемый ядром, может возбуждать отдельные изолированные низколежащие ядерные уровни. При снятии такого возбуждения происходит излучение ядром одного или нескольких фотонов. Это явление носит название ядерной резонансной флуоресценции (ЯРФ).
<br>   В области II энергия поглощенного фотона достаточна для выбивания из ядра одного или нескольких нуклонов, а также систем из малого числа связанных нуклонов. Для тяжелых ядер возможно также деление (фотоделение). Все эти процессы объединяют термином фоторасщепление. Наиболее характерной особенностью этой энергетической области является наличие высокоэнергичных коллективных ядерных возбуждений, проявляющихся в мощных и широких максимумах, называемых гигантскими резонансами. Самый значительный из них обусловлен преимущественным поглощением электрических дипольных (Е1) фотонов и поэтому называется гигантским дипольным резонансом.
<br>   Гигантский резонанс связывают с возбуждением гамма-квантами собственных колебаний протонов относительно нейтронов (дипольные колебания). Нуклоны могут покидать ядро непосредственно в процессе дипольных колебаний, но могут испускаться и после их затухания. Упорядоченные колебания нуклонов постепенно переходят в весьма сложное «тепловое» движение. В результате образуется возбуждённое составное ядро, из которого «испаряются» протоны или нейтроны. 
<br>   В области III ядерное фоторасщепление  чаще всего начинается с расщепления этих связанных малонуклонных систем, главным образом квазидейтронов, и завершается испусканием ядром нескольких (до десяти) нейтронов.
Начиная с мезонного порога (область IV), фотон взаимодействует с отдельными нуклонами, переводя их в возбужденное (резонансное) состояние.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop14() {
    let a = 14, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   С точки рения энергии, существуют несколько классификаций, самая общая это разделение на тепловые эпитепловые и быстрые. D самой развёрнутой, что я знаю:(Ультрахолодные / Холодные / Тепловые / Резонансные / Медленные / Промежуточные / Быстрые / Сверхбыстрые / Релятивистские)
        <br>   Информации в лекции вполне достаточно (мало ,что возможно добавить).
        <br>   Нейтрон, как элементарная частица, при взаимодействии с веществом проявляет волновые свойства (необходимо вспомнить длину волны де бройля).
        <br>   Нейтрон по мере прохождения через вещество помимо упругого
рассеяния, в результате которого нейтрон теряет часть энергии и
создаёт ядра отдачи, испытывает неупругое рассеяние, радиационный захват и вступает в ядерные реакции : (n,p), (n,α), (n,2n). В реакциях с тяжёлыми, делящимися ядрами может произойти акт деления с испусканием, как правило, двух радиоактивных ядер
(осколков) и двух или более нейтронов.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop15() {
    let a = 15, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   К основным процессам взаимодействия заряженных частиц с атомами можно отнести следующие: • упругое рассеяние в кулоновском поле атомов, следствием которого в основном является изменение направления движения частиц; • неупругие столкновения с атомными электронами, в результате которых энергия частиц расходуется на возбуждение и ионизацию атомов; • тормозное излучение, заключающееся в испускании электромагнитного излучения в электрическом поле атомов; • упругие и неупругие столкновения с ядрами атомов, следствием которых является рассеяние частиц, возбуждение ядер, рождение новых частиц.
        <br>   В принципе взаимодействие любой частицы с веществом можно легко описать уравненеем бетте блоха, но для тяжелых частиц (точный) расчёт дозы проблематичен, из-за флуктуаций энергии, связанный с электронными обителями атомов (а также влияние импульса частицы и квадрата угла многократного рассеяния в тканях пациента). Кратко: чем больше масса заряженного кластера частиц и меньше площадь поперечного сечения, тем глубже может проникнуть максимальная доза.
        Удельные потери энергии заряженной частицей:dE/dx.
        <br>   Тяжёлые заряженные частицы взаимодействуют главным образом с электронами атомных оболочек, вызывая ионизацию атомов. Проходя через вещество, заряженная частица совершает десятки тысяч соударений, постепенно теряя энергию. Тормозная способность вещества может быть охарактеризована величиной удельных потерь энергии dE/dx, где dE − энергия, теряемая частицей в слое вещества толщиной dx. Если энергия заряженной частицы теряется на ионизацию среды, то говорят об удельных ионизационных потерях.
        <br>   Если тяжелая заряженная частица, например протон или α-чатица, обладают достаточной кинетической энергией (~ 100 МэВ),
то в случаях когда их прицельный параметр меньше радиуса ядра,
она может испытать неупругое взаимодействие с ядром. В этом
процессе первичная заряженная частица прямо взаимодействует с
одним или несколькими нуклонами ядра, передавая им в столкновении свою кинетическую энергию. В результате ядерные нуклоны
могут быть испущены из ядра в процессе внутриядерного каскада.
<br>   Их угловое распределение является сильно вытянутым вперед. Ядро, оказавшееся после этого в сильно возбужденном состоянии,
выходит из него через эмиссию так называемых испарительных
частиц (главным образом, нуклонов с относительно низкой энергией) и γ-излучения. Данный эффект изменяет пространственное распределение поглощенной дозы, так как часть кинетической энергии, которая могла бы быть передана в среду через процессы локальное возбуждения и ионизации, теперь будет унесена испарительными нейтронами и γ-излучением.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop16() {
    let a = 16, b = "(0_0)";
    let result = true;
    //result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        (основная инфа в лекциях)
        <br>   Прохождение электронов через вещество отличается от прохождения тяжёлых заряженных частиц. Главная причина - малая масса электрона. Относительно большое изменение импульса электрона при каждом столкновении с частицами среды вызывает заметное изменение направления движения электрона (придаёт ускорение!) электромагнитное («тормозное») излучение.
        <br>   Электрон испытывает два типа потерь энергии: Ионизационные потери  и Радиационные потери (резком изменении направления движения или торможении), простым языком магия.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop17() {
    let a = 17, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.

        <br>   В радиационной физике термин «поглощенная доза» используется для описания последствия взаимодействия между ионизирующим излучением и средой. <br>   Поглощенная доза является нестохастической величиной, которая связана с соответствующей некой детерминированной величиной энергии ε- − ожидаемое (среднее) значение энергии, поглощенной внутри конечного объема в течение определенного временного интервала в результате взаимодействия между ионизирующим излучением и веществом, и обозначается D. 
        <br>   ВАЖНО, что в этом случае речь идет об энергии, которая остается в веществе вокруг точки интереса.
        <br>   Единицей измерения поглощенной дозы D, так же как и кермы K, в СИ является грей (Гр), и на практике нередко используется рад.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop18() {
    let a = 18, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   Поглощение энергии ионизирующего излучения является первичным процессом, дающим начало последовательности физико-химических преобразований в облученном объекте, приводящим к наблюдаемому радиационному эффекту. 
        <br>   Поэтому естественно сопоставить наблюдаемый эффект с количеством поглощенной энергии или поглощенной дозы.
        <br>   Взаимодействие γ-квантов с 1 см3 воздуха с образованием вторичных электронов, в свою очередь создающих ионы как внутри, так и вне рассматриваемой массы воздуха, значит можно предположить что суммарная кинетическая энергия всех электронов, входящих в рассматриваемый объем вещества, равна суммарной кинетической энергии электронов, покидающих его.
        <br>   Равновесие заряженных частиц наблюдается в данной точке среды в случае, если на расстоянии максимального пробега вторичных заряженных частиц во всех направлениях от данной точки и среда и поле заряженных частиц могут считаться однородными. В случаях не соблюдения этих условий говорят об относительном энергетическом равновесии (в рамках данного курса не интересует).
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop19() {
    let a = 19, b = "(0_0)";
    let result = true;
   // result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   В принципе взаимодействие любой частицы с веществом можно легко описать уравнением бетте блоха, в частности для положительных заряженных частиц, протоны, ядра атомов, например углерод.
        <br>   Пик Брэгга—ярко выраженный пик на кривой Брэгга, отражающей потери энергии ионизирующего излучения при его прохождении через вещество. Для протонов, α-частиц и ионов пик возникает непосредственно перед тем, как частицы остановятся.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop20() {
    let a = 20, b = "(0_0)";
    let result = true;
   // result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   Область, в которой распространяется излучение, называют полем излучения и характеризуют: 
        ♦энергией частиц; 
        ♦направлением их распространения; 
        ♦флюенсомчастиц. 
        <br>   Флюенси плотность потока частиц (фотонов) излучения являются мерой поля излучения при его переносе в среде от источника к облучаемому объекту. 
        <br>   Флюенс частиц Φ –отношение ожидаемого числа частиц dN, проникающих в элементарную сферу, к площади центрального сечения dSэтой сферы и нельзя забывать про плотность потока частиц, это флюенс / время
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop21() {
    let a = 21, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   Процесс, включающий в себя заполнение электроном вакансии, образованной на одном из внутренних уровней энергии атома, с передачей безызлучательным путём выделенной при этом энергии электрону другого (вышележащего) уровня и переводом его в возбуждённое состояние, если переданная энергия достаточна, то возбуждённый электрон покидает атом 
        <br>   В обозначении оже-переходов сначала указывают уровень, на к-ром образована первичная вакансия, затем уровень, эл-н которого заполнил эту вакансию, и последним — уровень, который покинул оже-электрон.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop22() {
    let a = 22, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        (на основе лекции)
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   Экспозиционная доза, Х, - количественная характеристика гамма- и рентгеновского излучения, основанная на их ионизирующем действии в воздухе - отношение полного заряда dq всех ионов одного знака, создаваемых в воздухе, к массе воздуха в этом объеме.
        <br>   Единицей измерения экспозиционной дозы в СИ является кулон на килограмм (Кл/кг). На практике распространена внесистемная единица экспозиционной дозы – рентген, обозначение Р
        <br>   Кл/кг =3,88·10^3 Р
        <br>   Под линейной передачей энергии (ЛПЭ) понимают среднюю энергию, затраченную первичной частицей на прямое взаимодействие, приводящее к возникновению вторичных электронов с энергией, не превышающей заданного значения Δ, выраженного обычно в электронвольтах.
        <br>   В оценках радиационных эффектов, возникающих при воздействии заряженных частиц космического пространства, значения ЛПЭ приравнивают к удельным потерям энергии, dE/dx, – средней энергии, которую частица теряет на единице своего пути.
•	ЛПЭ – основная физическая величина, которая количественно характеризует энергетический вклад одной частицы в образование радиационного эффекта,
•	ЛПЭ, L – средняя энергия, которую вещество может получить от налетающей заряженной частицы на единице ее пути
•	Единицы измерения ЛПЭ - МэВ/см или МэВ/(г/см2).

        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop23() {
    let a = 23, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   Термин "керма" представляет аббревиатуру от "кинетическая энергия, освобождаемая в единице массы" и применяется только к косвенно ионизирующему излучению (фотоны и нейтроны). Керма связана с соответствующей стохастической величиной ε и обозначается K. Значение кермы в точке интереса Р к массе (в замкнутом объёме), в данном случае это энергия, переданная косвенно ионизирующим излучением в конечном объеме в течение определенного временного интервала
        <br>   Единицей измерения кермы в СИ служит Дж/кг, называемая греем (Гр). Таким образом, керма является ожидаемым (средним) значением энергии, переданной заряженным частицам при взаимодействии косвенно ионизирующего излучения с веществом, на единицу массы в выбранной точке интереса, включая радиационные потери энергии, но исключая энергию, переданную от одной заряженной частицы к другой.
        <br>   С точки рения фотонного и нейтронного излучений, то материала лекций достаточно.
        <br>   В случае фотонного излучения керма представляет собой энергию, передаваемую при взаимодействии электронам и позитронам в единице массы вещества.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop24() {
    let a = 24, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Основа в лекции!
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   Согласно современным представлением о биологическом действии ионизирующих излучений важнейшую роль играет ионизация живой ткани, которая непосредственно связана с величиной поглощенной дозы. Однако экспериментальные исследования показали, что поглощенная доза не может служить однозначной мерой биологического воздействия на живые организмы. При очень низких дозах не наблюдается никаких детерминированных биологических эффектов, но после определенного порога такие эффекты начинают проявляться, становясь все более тяжелыми с увеличением дозы. Когда же эксперименты выполнялись при разных условиях облучения (пространственное распределение дозы в организме, мощность дозы, дробность облучения) и с разными видами ионизирующего излучения, то при одинаковой поглощенной дозе биологический эффект оказывался разным.
        <br>   Для сравнения биологических эффектов, производимых одинаковой поглощенной дозой, но различными видами излучения используется понятие относительная биологическая эффективность (ОБЭ). <br>   Под ОБЭ излучения в настоящее время понимают отношение поглощенной дозы референтного излучения с низкой ЛПЭ к поглощенной дозе данного рассматриваемого вида излучения, которые вызывают одинаковый биологический эффект в одинаковых условиях облучения.
        ОБЭ зависит от: 
        ♦рассматриваемого эффекта; 
        ♦дозы и мощности дозы; 
        ♦вида излучения, его энергии, ЛПЭ и т. д.
        <br>   В настоящее время коэффициент качества Q заменен взвешивающими коэффициентами при определении понятия эквивалентной дозы, но он по-прежнему применяется для расчета операционных величин эквивалента дозы, используемых для проведения мониторинга.
        <br>   Также нельзя забывать, что значения ОБЭ для выбранного вида излучения зависят от условий облучения, включая вид рассматриваемого биологического эффекта, облучаемую ткань или тип клеток, уровень дозы и мощности дозы, а также схему фракционирования облучения. Следовательно, для данного вида и энергии излучения имеется набор значений ОБЭ. ОБЭ достигает максимального значения при малых дозах и мощностях доз.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop25() {
    let a = 25, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   Эквивалентная доза равна произведению средней поглощенной дозы DTR, созданной данным видом ионизирующего излучения в органе или ткани T, на взвешивающий коэффициент wR для излучения R, характеризующий его качество.
        <br>   Для учета зависимости биологических эффектов в области малых доз от вида ионизирующего излучения, вводится дозиметрическая величина – эквивалентная доза в органе или ткани.
        <br>   На основе эквивалентных доз происходит оценка возможного ущерба здоровью человека при хроническом воздействии ионизирующего излучения произвольного состава на определенный орган человека.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop26() {
    let a = 26, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Основа в лекциях!
        Доза - мера энергии, которая передана ионизирующим излучением мишени. Обычно термин используется без уточнения, когда контекст делает смысл очевидным, или в качестве общего термина, когда различные определители могут быть использованы в равной степени.
        <br>   Термины «доза», «экспозиционная доза», «поглощенная доза» не так однозначны, как это может показаться на первый взгляд. Вокруг них велась (и ведется) бурная дискуссия. Например, термин «доза» может пониматься как: 1) некоторое количество чего-либо, предназначенное для передачи или переданное кому-либо или чему-либо; 2) некоторое количество чего-либо независимо от того, предназначено или нет это количество кому-либо или чему-либо. В системе терминов, рекомендованных законодательством России, принято первое из указанных двух значений «дозы». Применительно к ионизирующему излучению «количество чего-либо» означает энергию излучения. <br>   Исходя из такого энергетического понимания «дозы», понятие «доза излучения» определяется как энергия излучения, предназначенная для передачи или переданная веществу и рассчитанная на единицу массы этого вещества. В этом определении «дозы излучения» слово «переданная» еще не означает, что энергия излучения полностью осталась в веществе, т. е. воспринята и поглощена веществом. Часть переданной энергии после различных преобразований может выйти из рассматриваемого объема вещества. В отличие от этого «поглощенная энергия излучения» - это та энергия, которая фактически остается в веществе и, в конечном итоге, определяет радиационный эффект облучения. Через поглощенную энергию излучения определена «поглощенная доза излучения» («поглощенная доза»). Здесь важно помнить о существенном различии между понятием об энергии излучения, переданной веществу, и понятием о поглощенной энергии излучения.
        <br>   По факту, эффективная доза это дополнительная поправка влияния излучения не на человека в целом, а на  его ткани.
        <br>   Важность данной поправки обеспечивается предотвращением 4 вероятных факторов/возможностей:
        <br>   вероятность, приписываемая летальному раку; 
        <br>   взвешенная вероятность, приписываемая нефатальному раку; •
        <br>   взвешенная вероятность тяжелых генетических эффектов; • 
        <br>   относительное сокращение продолжительности жизни.
        <br>   Таким образом, эффективная доза является расчетной универсальной дозиметрической величиной, вычисление которой основано на знании распределения поглощенной дозы, взвешивающих коэффициентов и справочных значениях параметров организма человека, его органов и тканей. Она используется для оценки последствий радиационного воздействия при внешнем общем или локальном облучении, а также поступлении радиоактивных веществ в организм с учетом радиочувствительности различных органов и тканей.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop27() {
    let a = 27, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        На следующие темы (газонаполненного детектора) было выделено 4 занятия, на которых общий запас знаний не сильно изменился.
        <br>   Заранее хочу прояснить, преподаватель В.В. рассказывала на более глубоком уровне (относительно практического применения), чем меня  учили в предыдущем семестре (под руководством И.А.), акцентированное внимание в данном отличается от моего, далее я изложу то, что сам считаю важным (без расчёта газового усиления и без расчёта поля в рабочем объёме)!

        <br>   Такой детектор представляет собой высоковольтный конденсатор с газом между обкладками(их называют электродами). (Возможно наличие третьего электрода в виде сетки)
        <br>   Регистрируемая частица ионизирует и возбуждает атомы или молекулы газа вдоль своего трека (необаятельно прямая). Тем самым образуются свободные носители заряда при ионизации
Время собирания зависит от подвижности зарядов в электрическом поле в рабочем объеме и от расстояния до собирающего электрода.
Под действием приложенного напряжения, образовавшиеся в результате электроны (ионы) собираются на электродах.
На данный момент важно упомянуть, что детекторы имеют разные режимы работы, а именно ионизирующая камера, пропорциональный счётчик и счётчик Гейгера.
<br>   Счётчики наполняются электроположительными газами (инертные газы, метан, пропан, этилен и т.д.). Внутри счётчика создают резко (как правило, неоднородное, зависит от формы рабочего объёма, например если понадобится детектировать частицы и их точное местоположение) электрическое поле.
НА ВАХ показаны зависимости количества регистрируемых электрон-ионных пар от приложенного напряжения. График делится на 5/6 участков, (как по мне правильнее и практичнее на 5).
<br>   Зона рекомбинации, Ионизационное плато, зона пропорциональности, плато Гейгера-Мюллера и пробой(выход из строя устройства).
<br>   Зона рекомбинации – участок в котором напряжение изменяется от 0 до U0, где U0 является точкой начала насыщения газа ионами.
При возрастании напряжения, ток растёт нелинейно(как видно из графика), ИИ генерирует ионы из молекул газа, а разность потенциала предотвращает рекомбинацию зарядов, на данном участке как не странно выполняется закон ОМА.
<br>   При увеличении поля скорость ионов увеличивается, что уменьшает вероятность рекомбинации, растет количество собранных зарядов и, соответственно, амплитуда сигнала (ток) растёт. Важно отметить, что для разных типов излучения количество электроных пар сильно отличается, тяжелые заряженные частицы  > альфа > протонов > электронов > нейтронов > фотонов. Данный участок не интересен и не используется в дозиметрии. Присутствует исключительно первичная ионизация.
Принцип работы второй области аналогичен закону 3/2, если кто-то о нём слышал.
<br>   При дальнейшем увеличении напряжения амплитуда сигнала достигает насыщения (ток можно принять за константу) и практически перестает расти с ростом приложенного напряжения.  На участке II практически все заряды, образованные в детекторе, собираются на электродах. Этот участок кривой называют областью насыщения. В данном диапазоне напряжений работают ионизационные детекторы.
Недостатком ионизационной камеры являются очень низкие токи, которые довольно трудно регистрировать
Присутствует исключительно первичная ионизация.
<br>   По мере дальнейшего повышения напряжения детектор начинает работать в пропорциональной области (III). Электроны, образованные в результате первичной ионизации, приобретают достаточную энергию, чтобы в свою очередь вызвать ионизация атомов или молекул газа, (начинается процесс вторичной ионизации). Происходит так называемое газовое усиление. Область называется пропорциональной, т.к. коэффициент газового усиления пропорционален приложенному напряжению. Газовое усиление – это увеличение количества свободных зарядов в объёме детектора за счёт того, что первичные электроны на своём пути к аноду в больших электрических полях приобретают энергию достаточную для ударной ионизации нейтральных атомов рабочей среды детектора. Стоит упомянуть -лавинный разряд, который сопровождается явлением газового усиления. Это область работы пропорциональных счетчиков. Сложно предугадать, что может потребоваться на экзамене, возможно вскоре будут внесены изменения.
<br>   Четвертый участок это область в которой газовое усиление возрастает настолько, что собираемый заряд не зависит от первичной ионизации (происходит Коронный разряд, ионизируется весь рабочий объём камеры). Однако разряд, как и в предыдущих областях, остается вынужденным, т. е. начинается после прохождения ионизирующей частицы. 
Характерной особенностью коронного разряда является то, что сила тока в нём обусловлена не сопротивлением внешней цепи, а ограниченной проводимостью внешней области разряда, которая зависит от геометрии электродов, напряжения между ними, а также от природы и состояния газа. 
Лавинный разряд сопровождается явлением газового усиления, которое связано с процессами вторичной ионизации и сопровождается увеличением заряда, собираемого на электродах, по сравнению с зарядом «первичных» пар ионов. На данном аффекте работаю газа разрядные детекторы (здесь стоит упомянуть самогасящиеся и не самогасящиеся, смотрите лекцию). 
Газоразрядные счётчики обладают большим мёртвым временем, что ограничивает их использование при больших мощностях дозы. Дозиметры с газоразрядными счётчиками являются самыми распространёнными приборами для целей радиационной безопасности. Они просты и надёжны в эксплуатации. Их используют и в пунктах контроля радиационной обстановки вокруг атомных объектов, и в системе аппаратурного контроля радиационной безопасности (АКРБ) на АЭС, и в большинстве бытовых дозиметров индикаторов.
<br>   На последнем участке наличие ИИ не нужно, ионизация будет проходить сама при высокой разности потенциалов (всё идётк непрерывному разряду), произойдёт КЗ и счётчик выйдет из строя.        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop28() {
    let a = 28, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        На следующие темы (газонаполненного детектора) было выделено 4 занятия, на которых общий запас знаний не сильно изменился.
        <br>   Заранее хочу прояснить, преподаватель В.В. рассказывала на более глубоком уровне (относительно практического применения), чем меня  учили в предыдущем семестре (под руководством И.А.), акцентированное внимание в данном отличается от моего, далее я изложу то, что сам считаю важным (без расчёта газового усиления и без расчёта поля в рабочем объёме)!
        <br>   (Чувствительность детектора. Ионизационный ток и плотность ионов. Чётко по лекции)
        <br>   Ионизационная камера это газонаполненный детектор работающий во второй области (области насыщения). Ей измеряют или ионизационный ток, или заряды электричества, возникающие в газовом объёме. Для разделения разноимённых зарядов к газовому объёму прикладывают определённую разность потенциалов.
Ионизационная камера может быть выполнена в виде плоского или цилиндрического конденсатора. Величина прикладываемого напряжения (обычно сотни вольт) подбирается так, чтобы образованные в камере при пролёте заряженной частицы свободные заряды максимально быстро, не успев рекомбинировать, достигали электродов.
Ионизационные камеры работают при напряжениях, соответствующих тихому несамостоятельному разряду в газе
Напряжение на электродах каждой конкретной ионизационной камеры обусловливается конструкцией, давлением и природой газа-наполнителя. Оно должно обеспечивать протекание через газ тока насыщения. <br>   При таком напряжении все ионы, образованные ядерным излучением в рабочем объёме, попадают на электроды, а ионизационная камера характеризуется максимальной чувствительностью. 
<br>   Ионизационные камеры бывают интегрирующие  и импульсные. В интегрирующих камерах при больших потоках частиц импульсы сливаются и регистрируется ток пропорциональный среднему энерговыделению.
Ионизационная камера может служить не только счетным, но и спектрометрическим детектором, т.е. позволяет определять энергию частицы. Это возможно вследствие независимости средней энергии, затрачиваемой в газе на образование одной пары электрон-ион, от энергии ионизирующей частицы и от производимой ею удельной ионизации, определяющейся зарядом и скоростью частицы. Поэтому величина заряда, образованного частицей в рабочем объеме камеры, пропорциональна энергии, потерянной частицей в газе, а в случае полного поглощения частицы в рабочем объеме камеры - ее энергии.
<br>   ДОПОЛНЕНИЕ ко второй части вопроса:
<br>   При давлении, соответствующем максимуму тока J-макс, изменения скоростей образования и рекомбинации ионов равны по абсолютной величине и противоположны по знаку. После максимума тока рекомбинация ионов становится очень большой. При дальнейшем повышении давления скорость рекомбинации ионов растет быстрее скорости образования ионов, поэтому ионизационный ток начинает монотонно падать. Давление газа изменяет как нижнее, так и верхнее граничные напряжения области насыщения. При повышении давления начальное напряжение становится больше. Однако и верхнее напряжение сдвигается в более высокую область. Электроны в более плотных газах имеют меньший свободный пробег, чем в менее плотных. <br>   Энергия, которую получает электрон от электрического поля на свободном пробеге, в первом случае меньше, чем во втором. <br>   Чтобы ускорить электрон до энергии, большей энергии ионизации молекул, необходимо более высокое напряжение.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop29() {
    let a = 29, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        На следующие темы (газонаполненного детектора) было выделено 4 занятия, на которых общий запас знаний не сильно изменился.
        <br>   Заранее хочу прояснить, преподаватель В.В. рассказывала на более глубоком уровне (относительно практического применения), чем меня  учили в предыдущем семестре (под руководством И.А.), акцентированное внимание в данном отличается от моего, далее я изложу то, что сам считаю важным (без расчёта газового усиления и без расчёта поля в рабочем объёме)!
        Конструкция есть и подробно разобрана в лекции (три типа цилиндр, плоскопараллельные и сферический), стоит отметить, что параллельные могут быть в виде спирали (две спирали анод, катод с воздушным зазором), исключительно в виде прототипа (есть упоминания в статьях и нескольких патентов)
        <br>   Ионизационные камеры бывают токовые (интегральные), с помощью которых измеряют ионизационные токи от потока излучения, и импульсные, с помощью которых измеряют ионизацию, вызываемую отдельными частицами. К группе интегральных камер относятся: собственно токовые камеры и интегрирующие камеры. Токовые камеры применяют для измерения активности α-, β- и γ- препаратов, интенсивность α-излучения и мощности дозы от потока нейтронов, а также γ- и рентгеновского излучения. С помощью интегрирующих камер определяют мощности дозы γ-, рентгеновского и жёсткого β- излучения, а также потока нейтронов.
        <br>   Токовые камеры применяют для измерения активности α-, β- и γ- препаратов, интенсивность α-излучения и мощности дозы от потока нейтронов, а также γ- и рентгеновского излучения. С помощью интегрирующих камер определяют мощности дозы γ-, рентгеновского и жёсткого β- излучения, а также потока нейтронов.
<br>   В интегрирующих камерах при больших потоках частиц импульсы сливаются, и регистрируется ток пропорциональный среднему энерговыделению. В токовых ионизационных камерах гальванометром измеряется сила тока I, создаваемого электронами и ионами. Зависимость I от V в зоне насыения.
<br>   В импульсных камерах регистрируются отдельные импульсы от каждой ионизирующей частицы. Амплитуда импульса пропорциональна энергии частицы. Однако это условие выполняется только тогда, когда амплитуда импульса не зависит от направления движения частицы в газе. Данное затруднение снимается в камере с сеткой. Вблизи собирающего электрода помещают сетку из тонких проволок. На сетку подаётся отрицательный потенциал, немного меньший потенциала высоковольтного электрода. Сетка имеет большую проницаемость для электронов и практически все электроны попадают в объём газа между сеткой и собирающим электродом. Одновременно сетка экранирует собирающий электрод от воздействия положительных ионов, которые и влияют на амплитуду импульсов в камере без сетки. Вследствие этого амплитуда импульсов в камере с сеткой зависит только от энергии частиц.

    `
    }
    document.getElementById("OTv").innerHTML = b;
}

function Vop30() {
    let a = 30, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        На следующие темы (газонаполненного детектора) было выделено 4 занятия, на которых общий запас знаний не сильно изменился.
        <br>   Заранее хочу прояснить, преподаватель В.В. рассказывала на более глубоком уровне (относительно практического применения), чем меня  учили в предыдущем семестре (под руководством И.А.), акцентированное внимание в данном отличается от моего, далее я изложу то, что сам считаю важным (без расчёта газового усиления и без расчёта поля в рабочем объёме)!
        смотрите следующий текст как дополнение к лекции!
        <br>   Пропорциональный счётчик -газоразрядный прибор для регистрации ионизирующих излучений, создающий сигнал, амплитуда которого пропорциональна энергии регистрируемой частицы, теряемой в его объеме на ионизацию.
        <br>   Работа пропорционального счётчика основана на явлении газового усиления. Газовое усиление это увеличение количества свободных зарядов в объёме детектора за счёт того, что первичные электроны на своём пути к аноду в больших электрических полях приобретают энергию достаточную для ударной ионизации нейтральных атомов рабочей среды детектора. Возникшие при этом новые электроны в свою очередь успевают приобрести энергию достаточную для ионизации ударом. Таким образом, к аноду будет двигаться нарастающая электронная лавина.
        <br>   В названии отражено то, что в этом приборе амплитуда импульса тока (или полный собранный заряд) остаётся пропорциональной энергии, затраченной заряженной частицей на первичную ионизацию среды детектора. Таким образом, пропорциональный счётчик способен выполнять функции спектрометра, как и ионизационная камера. Энергетическое разрешение пропорциональных счетчиков лучше, чем у сцинтилляционных, но хуже, чем у полупроводниковых.
        <br>   В результате вместо каждого первичного электрона на анод приходит лавина электронов и полное число электронов, собранных на аноде пропорционального счётчика, во много раз превышает число первичных электронов. Отношение полного числа собранных электронов к первоначальному количеству называется коэффициентом газового усиления (в формировании импульса участвуют также и ионы).
        <br>   Газовое усиление имеет место при любой геометрии электродов, однако наибольшее распространение получили цилиндрические пропорциональные счётчики, для которых характерны низкие значения рабочего напряжения, широкие возможности применения и компактность.
        <br>   Отношение числа ионов n, образовавшихся в результате газового усиления, к первоначальному числу ионов n0, образованных частицей, называется коэффициентом газового усиления М.
        <br>   Коэффициент М выбирается в зависимости от
	энергии частицы, 
	рода работы (счёт или измерение энергии) 
	оптимального соотношение сигнал-шум.

    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop31() {
    let a = 31, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        На следующие темы (газонаполненного детектора) было выделено 4 занятия, на которых общий запас знаний не сильно изменился.
        <br>   Заранее хочу прояснить, преподаватель В.В. рассказывала на более глубоком уровне (относительно практического применения), чем меня  учили в предыдущем семестре (под руководством И.А.), акцентированное внимание в данном отличается от моего, далее я изложу то, что сам считаю важным (без расчёта газового усиления и без расчёта поля в рабочем объёме)!
        <br>   смотрите следующий текст как дополнение к лекции!, особо нечего добавить.
        <br>   В пропорциональном счётчике газовый разряд развивается только в части объёма газа. В ней образуется сначала первичная ионизация, а затем и лавина электронов. Остальной объём не охватывается газовым разрядом. С повышением напряжения критическая область расширяется. В ней увеличивается концентрация возбуждённых молекул, а следовательно, и количество испущенных фотонов. Под действием фотонов из катода и молекул газа вырывается всё больше и больше фотоэлектронов. Последние в свою очередь дают начала новым лавинам электронов в объёме счётчика, не занятом газовым разрядом от первичной ионизации. Таким образом, повышение напряжения U приводит к распространению газового разряда по объёму счётчика.
        <br>   Счётчик Гейгера (или счётчик Гейгера-Мюллера) − газонаполненный счётчик заряженных элементарных частиц, электрический сигнал с которого усилен за счёт вторичной ионизации газового объёма счётчика и не зависит от энергии, оставленной частицей в этом объёме.
        <br>   Возникает вспышка коронного разряда и через счётчик течёт ток.
        <br>   Распределение электрического поля в счётчике таково, что разряд развивается лишь в вблизи анода
счётчика на расстоянии нескольких диаметров нити. Электроны быстро скапливаются на нити (не более 10-6
сек), вокруг которой образуется «чехол» из положительных ионов. Положительный пространственный заряд
увеличивает эффективный диаметр анода и снижает тем самым напряжённость поля, поэтому разряд
прерывается. По мере удаления слоя положительных ионов от нити его экранирующее действие ослабляется
и напряжённость поля вблизи анода становится достаточной для образования новой вспышки разряда.
<br>   Положительные ионы, приближаясь к катоду, выбивают из последнего электроны, в результате чего
образуются нейтральные атомы инертного газа в возбуждённом состоянии. Возбуждённые атомы при
достаточном приближении к катоду, выбивают из его поверхности электроны, которые становятся
родоначальниками новых лавин. Без внешнего воздействия такой счётчик находился бы в длительном
прерывистом разряде. 
<br>   Самогасящиеся счётчики допускают большую скорость счёта без специальных электронных схем
гашения разряда, поэтому они нашли широкое применение. Самогасящиеся счётчики с органическими
гасящими примесями имеют ограниченный срок работы (108
 -1010 импульсов). При использовании в качестве
гасящей примеси одного из галогенов (чаще всего применяется менее активный Br2) срок службы становится
практически неограниченным из-за того, что двухатомные молекулы галогена после диссоциации на атомы (в
процессе разряда) образуются снова. К недостаткам галогенных счётчиков следует отнести сложность
технологии их изготовления из-за химической активности галогенов и большое время нарастания переднего
фронта импульсов из-за прилипания первичных электронов к молекуле галогена. «Затягивание» переднего
фронта импульса в галогенных счётчиках делает их неприменимыми в схемах совпадений.
<br>   Основными характеристиками счётчика являются: счётная характеристика – зависимость скорости
счёта от величины рабочего напряжения; эффективность счётчика – выраженное в процентах отношение
числа считаемых частиц к числу всех частиц, попадающих в рабочий объём счётчика; разрешающее время –
минимальный интервал времени между импульсами, при котором они регистрируются раздельно и срок
службы счётчиков.
        <br>   Распределение электрического поля в счётчике таково, что разряд развивается лишь в вблизи анода счётчика на расстоянии нескольких диаметров нити (снова акцентирую на этом внимание).

    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop32() {
    let a = 32, b = "(0_0)";
    let result = true;
    //result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        На лекции не проходили, добавить нечего.
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop33() {
    let a = 33, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   Принцип работы сцинтилляционного счётчика основан на эффекте свечения (люминесценции) некоторых веществ под действием излучения.
        <br>   Процессы люминесценции (высвечивания) например фосфора делят на два вида: флуоресценции и фосфоресценции.
        <br>   При прохождении заряженной частицы через сцинтиллятор в нем возникает некоторое число фотонов с той или иной энергией. Часть этих фотонов будет поглощена в объеме самого сцинтиллятора, и вместо них будут испущены другие фотоны с несколько меньшей энергией. В результате процессов реабсорбции наружу будут выходить фотоны, спектр которых характерен для данного сцинтиллятора.
        <br>   Твердые неорганические сцинтилляторы представляют собой кристаллы неорганических солей. Практическое применение в сцинтилляционной технике имеют главным образом галоидные соединения некоторых щелочных металлов. Для увеличения светового выхода таких сцинтилляторов вводятся специальные примеси других элементов, называемых активаторами (например, таллий). Сцинтиллятор, построенный на основе кристалла NaI(Tl), обладает большим световым выходом.
        Сравнительно новыми являются сцинтилляторы на основе кристаллов ортогерманата висмута (Bismuth Germanate Oxide)- BGO. Имея большую плотность, по сравнению с NaI, BGO-детекторы обладают значительно большей эффективностью регистрации γ-излучения, особенно в высокоэнергетической области.
        В рамках данного курса под сцинтиллятором подразумевают кристалл, но нельзя забывать про жидкие и газообразные вещества.
        <br>   Жидкие органические сцинтилляторы представляют собой растворы флуоресцирующих веществ в прозрачных растворителях, мало поглощающих энергию излучения в фиолетовой и ультрафиолетовой частях спектра.
        <br>   Газовые сцинтилляторы. При прохождении заряженных частиц через различные газы в них наблюдалось появление сцинтилляций. Наибольшим световым - выходом обладают тяжелые благородные газы (ксенон и криптон).
        Основными характеристиками сцинтилляторов являются: спектр испускаемых определяемый вероятностью испускания фотонов данной длины волны; световой выход – отношение среднего числа фотонов одной сцинтилляции к энергии, затраченной частицей на торможение; энергетический выход – отношение суммарной энергии фотонов одной сцинтилляции к энергии, затраченной частицей на торможение; время высвечивания – время, в течение которого интенсивность отдельной сцинтилляции уменьшается в е раз. Все характеристики сцинтилляторов зависят от их химического состава, размеров и степени чистоты.
        Сцинтилляционные детекторы основаны на регистрации люминесценции, вызываемой действием излучения на люминофоры, в которых энергия излучения преобразуется в световые вспышки (сцинтилляции). Люминофоры, используемые для этих целей, обычно называются сцинтилляторами. В качестве сцинтилляторов используются различные вещества (твёрдые, жидкие, газообразные). Сцинтиллятор может быть органическим (кристаллы, пластики или жидкости) или неорганическим (кристаллы или стекла). Используются также газообразные сцинтилляторы.
        <br>   Сцинтилляционный счетчик представляет собой сочетание сцинтиллятора (фосфора, йодит натрия и т.д) и фотоэлектронного умножителя (ФЭУ). В комплект счетчика входят также источник электрического питания ФЭУ и радиотехническая аппаратура, обеспечивающая усиление и регистрацию импульсов ФЭУ.
        Основными характеристиками сцинтилляторов являются: световой выход, спектральный состав излучения и длительность сцинтилляций.
        <br>   Световым выходом или конверсионной эффективностью сцинтиллятора называется отношение энергии световой вспышки, выходящей наружу, к величине энергии Е заряженной частицы, потерянной в сцинтилляторе.
        <br>   Принцип действия сцинтилляционного счётчика состоит в следующем: заряженная частица, проходя через сцинтиллятор, наряду с ионизацией атомов и молекул возбуждает их. Возвращаясь в невозбуждённое (основное) состояние, атомы испускают фотоны. Излученный свет собирается – в спектральном диапазоне сцинтиллятора – на фотокатод у ФЭУ.
        <br>   Достоинства сцинтилляционного счётчика: высокая эффективность регистрации различных частиц; быстродействие; возможность изготовления сцинтилляторов разных размеров и конфигураций; высокая надёжность и относительно невысокая стоимость. Благодаря этим качествам сцинтилляционные счётчики широко применяется в ядерной физике.
        <br>   Про характеристики стоит знать, что Необходимые качества сцинтиллятора являются:
            высокий атомный номер и плотность,
            высокий выход света,
            хорошая прозрачность,
            низкий коэффициент преломления,
            малое время высвечивания,
            стабильность и невысокая стоимость.
        
            <br>   Что касается йодида натрия, мне не хочется выходить за рамки лекционного материала.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop34() {
    let a = 34, b = "(0_0)";
    let result = true;
    //result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <br>   Фотоны, попадая на фотокатод ФЭУ, в результате фотоэффекта выбивают электроны, в результате чего на аноде ФЭУ возникает электрический импульс, который далее усиливается динодной системы за счёт механизма вторичной электронной эмиссии. Анодный токовый сигнал ФЭУ – через усилитель или непосредственно - подается на вход измерительного прибора – счетчика импульсов, осциллографа, аналого-цифрового преобразователя и т.п. Амплитуда и длительность импульса на выходе определяются свойствами, как сцинтиллятора, так и ФЭУ.
        <br>   Электроника представлена на слайде лекции, добавить нечего.
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop35() {
    let a = 35, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        Спектрометрия с NaI(Tl). – слайд из лекции, добавить нечего (не является фундаментальным знанием, требующее подробного повествования).
        <br>   Амплитудное распределение импульсов при спектрометрии является спектральной характеристикой гамма-излучения.
        <br>   Самый левый край графика (крайняя точка спектра), очень близкая к области "нулевой амплитуды импульса", возникает, как правило, от низкоамплитудного электронного шума в детектирующей системе. Существует тенденция появления такого шума при довольно высокой частоте следования им пульсов и, таким образом, проявляется как явление высокой скорости счета. Электронный шум обычно отфильтровывается электронным способом, так что этот эффект обычно не подавляет показываемый спектр.
        <br>   Самый правый край -эта область обусловлена гамма-квантами высоких энергий и мюонами космического излучения, присутствующего в естественном фоне, и событиями наложения импульсов, если скорость счета достаточно высока.
        <br>   Пик обратного рассеяния. Этот пик обусловлен гамма-квантами, которые подверглись комптоновскому рассеянию в одном из материалов, окружающих детектор.
        Комптоновский край это часть спектра, которая соответствует максимальной потере энергии падающим фотоном в процессе комптоновского рассеяния. Это соответствует "лобовому" столкновению между фотоном и электроном, в результате которого электрон движется вперед, а гамма-квант рассеивается назад на 180.
        <br>   Минимальное количество частиц слева от фотопика – область, где возникают либо в результате многократного комптоновского рассеяния, либо в результате взаимодействий с полной потерей энергии фотонами, которые подверглись рассеянию на небольшие углы (в материале источника или в промежуточных материалах) перед тем, как попасть в детектор.
        <br>   Комптоновское плато - гладкий участок распределенные до максимальной энергии Еc , образуются в результате взаимодействий, происходящих только с частичной потерей энергии фотона в детекторе.
        <br>   Пик полного поглощения (фотопик). Этот пик объединяет импульсы, возникающие в результате фотоэлектрических взаимодействий с полной потерей энергии в детектирующей среде.
        <br>   Больше от себя добавить нечего, в лекции достаточно точно и кратко дано описание аппаратурной формы линии, пики утечки и суммарные пики (мне нечего добавить, информации достаточно для экзамена).
        
    `
    }
    document.getElementById("OTv").innerHTML = b;
}
function Vop36() {
    let a = 36, b = "(0_0)";
    let result = false;
    result = Vop(a);
    if (result) {
        window.location = "#OTv";
        b = `
        <a href="https://youtu.be/qm_zdFxwd70"><img src="img/ppd.webp"></a>
    `
    }
    document.getElementById("OTv").innerHTML = b;
}

function practD1(){
    let a=`
    <div><a href="https://www.ntcexpert.ru/documents/docs/nrb-99-2009.pdf" target="_blank">Нормы радиационной безопасности
    (НРБ-99/2009).</a></div>
    <div><a href="http://library.mephi.ru/pdftunnel.php?Z21FAMILY=%D0%BC%D0%B0%D0%BA%D1%81%D0%B8%D0%BC%D0%BE%D0%B2%D0%B0&Z21ID=62665&PATH=book-mephi%2FKlimanov_Dozimetriya_ioniziruyushchikh_izlucheniy_2015.pdf" target="_blank">Климанов В.А Дозиметрия.</a></div>
    <div><a href="https://ilmiy.bmti.uz/blib/files/77/%D0%A1%D0%B1%D0%BE%D1%80%D0%BD%D0%B8%D0%BA%20%D0%B7%D0%B0%D0%B4%D0%B0%D1%87%20%D0%BF%D0%BE%20%D0%B0%D1%82%D0%BE%D0%BC%D0%BD%D0%BE%D0%B9%20%D0%B8%20%D1%8F%D0%B4%D0%B5%D1%80%D0%BD%D0%BE%D0%B9%20%D1%84%D0%B8%D0%B7%D0%B8%D0%BA%D0%B5.pdf" target="_blank">Сборник задач по атомной и ядерной физике. </a></div>
    <div><a href="https://www.studmed.ru/view/ivanov-vi-kurs-dozimetrii_e25a44d7dc5.html" target="_blank">Иванов В.И. Курс дозиметрии.</a></div>
    <div><a href="https://portal.tpu.ru/files/departments/publish/FTI_Bespalov.pdf" target="_blank">Радиационная защита персонала организаций атомной отрасли.</a></div>
    `
    document.getElementById("boed1").innerHTML = a;
}
function practD2(){
    let a=`
    <hr>
    <div>Сбор данных:<br><img src="https://humanhealth.iaea.org/HHW/MedicalPhysics/NuclearMedicine/ImageAnalysis/3Dimagereconstruction/TOMO_gif_PET_signed.gif" alt="" width="40%"></div>
    <div>Реконструкция:<br><img src="https://humanhealth.iaea.org/HHW/MedicalPhysics/NuclearMedicine/ImageAnalysis/3Dimagereconstruction/TOMO_BP_gif_PET_signed.gif" alt="" width="40%"></div>
    <div>Фильтрование данных изображения:<br><img src="https://humanhealth.iaea.org/HHW/MedicalPhysics/NuclearMedicine/ImageAnalysis/3Dimagereconstruction/SINO_FILTER_gif_PET_signed.gif" alt="" width="40%"></div>
    <div>Реконструтрование:<br><img src="https://humanhealth.iaea.org/HHW/MedicalPhysics/NuclearMedicine/ImageAnalysis/3Dimagereconstruction/TOMO_FILT_BACK_PET_signed.gif" alt="" width="40%"></div>
    <div>
    <br>
    Код реализации программы для обработки изображения в Питоне:
    <br>
    <br>   from skimage.data import shepp_logan_phantom
    <br>   from skimage.transform import rescale, radon, iradon
    <br>   import matplotlib.pyplot as plt
    <br>   import numpy as np
    <br>   plt.ion()
    <br>   true_object = shepp_logan_phantom() # Тестовый объект для реконструкции
    <br>   true_object = rescale(true_object, 0.5) # Уменьшение объема обработки в 4 раза
    <br>   fig, axs = plt.subplots(2, 3, figsize=(10, 7))
    <br>   axs[0, 0].imshow(true_object, cmap='Greys_r'); axs[0, 0].set_title('true object')
    <br>   # Формирование прямой проекции (синограммы)
    <br>   azi_angles = np.linspace(0., 180., 180, endpoint=False) # Задание направлений (углов) сбораинформации
    <br>   sinogram = radon(true_object, azi_angles, circle=False) # Получение синограммы изображения(эталон)
    <br>   axs[0, 1].imshow(sinogram.T, cmap='Greys_r'); axs[0, 1].set_title('sinogram')
    <br>   mlem_rec = np.ones(true_object.shape) #0-я итерация изображения
    <br>   # Матрица эффективного вклада пикселя
    <br>   sino_ones = np.ones(sinogram.shape)
    <br>   sens_image = iradon(sino_ones, azi_angles, circle=False, filter_name=None) # Прямая проекциявкладов
    <br>   for iter in range(20):
    <br>      fp = radon(mlem_rec, azi_angles, circle=False) # Получение синограмы результата изображения
    <br>      ratio = sinogram / (fp + 0.000001) # Расчет матрицы соответствия ожидания ПОЭЛЕМЕНТНОЕ ДЕЛЕНИЕ
    <br>      correction = iradon(ratio, azi_angles, circle=False, filter_name=None) / sens_image # Расчет поправочного коэффициента (ПОЭЛЕМЕНТНОЕ ДЕЛЕНИЕ)
    <br>      axs[1, 0].imshow(mlem_rec, cmap='Greys_r'); axs[1, 0].set_title('MLEM recon')
    <br>      axs[1, 1].imshow(fp.T, cmap='Greys_r'); axs[1, 1].set_title('FP of recon')
    <br>      axs[0, 2].imshow(ratio.T, cmap='Greys_r'); axs[0, 2].set_title('Ratio Sinogram')
    <br>      axs[1, 2].imshow(correction, cmap='Greys_r'); axs[1, 2].set_title('BP of ratio')
    <br>      mlem_rec = mlem_rec * correction # Расчет последующей итерации
    <br>      axs[1, 0].imshow(mlem_rec, cmap='Greys_r'); axs[1, 0].set_title('MLEM recon image it=%d' % (iter +1))
    <br>      plt.show()
    <br>      plt.pause(0.5)
    <br>   plt.show(block=True)
    <br>
    <br><img src="https://i.stack.imgur.com/mvtKC.png" alt="" width="40%">
    </div>

    `
    document.getElementById("boed1").innerHTML = a;
}

function pract3() {
    let a = `<hr>На данный момент времени, автор не несёт ответственности за правильность ответов и как именно вы будете отвечать! <br>
    Изложенные в данном разделе ответы на экаменационные вопросы, написаны опираясь на лекционные знания, большой перечень литературных источников и в основном на моё понимание той или иной темы. То как бы я отвечал на экзамене. <hr>`, b = ``;
    b = `
    <div class="butOk" onclick="VoP1()">
    Образование р.спектра (основные взаимодействия e-) 
    </div>
    <div class="butOk" onclick="VoP2()">
    Взаимодействие р.фотонов с веществом (основные взаимодействия, преобладание эффектов) 
    </div>
    <div class="butOk" onclick="VoP3()">
    Закон линейного ослабления 
    </div>
    <div class="butOk" onclick="VoP4()">
    Слой половинного ослабления 
    </div>
    <div class="butOk" onclick="VoP5()">
    Планарная рентгенография 
    </div>
    <div class="butOk" onclick="VoP6()">
    Аксиальная томография 
    </div>
    <div class="butOk" onclick="VoP7()">
    Закон обратных квадратов 
    </div>
    <div class="butOk" onclick="VoP8()">
    1е поколение КТ 
    </div>
    <div class="butOk" onclick="VoP9()">
    2е поколение КТ 
    </div>
    <div class="butOk" onclick="VoP10()">
    3е поколение КТ 
    </div>
    <div class="butOk" onclick="VoP11()">
    4е поколение КТ 
    </div>
    <div class="butOk" onclick="VoP12()">
    5е поколение КТ 
    </div>
    <div class="butOk" onclick="VoP13()">
    Основные компоненты КТ и гентри 
    </div>
    <div class="butOk" onclick="VoP14()">
    Коллимация и фильтрация пучка 
    </div>
    <div class="butOk" onclick="VoP15()">
    Основные характеристики детекторов в КТ 
    </div>
    <div class="butOk" onclick="VoP16()">
    Круговая геометрия трансмиссионной вычислительной томографии 
    </div>
    <div class="butOk" onclick="VoP17()">
    Преобразования Радона 
    </div>
    <div class="butOk" onclick="VoP18()">
    Спиральная КТ 
    </div>
    <div class="butOk" onclick="VoP19()">
    360 LI интерполяция 
    </div>
    <div class="butOk" onclick="VoP20()">
    180 LI интерполяция 
    </div>
    <div class="butOk" onclick="VoP21()">
    Многосрезовая КТ 
    </div>
    <div class="butOk" onclick="VoP22()">
    Газонаполненные детекторы в КТ 
    </div>
    <div class="butOk" onclick="VoP23()">
    Сцинтилляционные детекторы в КТ 
    </div>
    <div class="butOk" onclick="VoP24()">
    Полупроводниковые детекторы в КТ 
    </div>
    <div class="butOk" onclick="VoP25()">
    Задача вычислительной томографии, метод двумерной фильтрация 
    </div>
    <div class="butOk" onclick="VoP26()">
    Устройство рентгеновской трубки 
    </div>
    <div class="butOk" onclick="VoP27()">
    Эффект «каблука» (Heel effect) 
    </div>
    <div class="butOk" onclick="VoP28()">
    Причины отказа р.трубки 
    </div>
    <div class="butOk" onclick="VoP29()">
    Устройство цепи р.трубки 
    </div>
    <div class="butOk" onclick="VoP30()">
    Влияние мА, кВп и иных факторов на энергетический спектр, контраст и 
    </div>
    <div class="butOk" onclick="VoP31()">
    Алгоритм MLEM – метода реконструкции 
    </div>
    <div class="butOk" onclick="VoP32()">
    Единицы Хаунсфилда, характерные значения тканей, окно отображения, ширина окна 
    </div>
    <div class="butOk" onclick="VoP33()">
    Методы представления изображений 
    </div>
    <div class="butOk" onclick="VoP34()">
    Высококонтрастное пространственное разрешение 
    </div>
    <div class="butOk" onclick="VoP35()">
    Поперечное пространственное разрешение, функция передачи модуляции 
    </div>
    <div class="butOk" onclick="VoP36()">
    Радиальное пространственное разрешение 
    </div>
    <div class="butOk" onclick="VoP37()">
    Азимутальное пространственное разрешение 
    </div>
    <div class="butOk" onclick="VoP38()">
    Профиль чувствительности среза 
    </div>
    <div class="butOk" onclick="VoP39()">
    Низкоконтрастное пространственное разрешение 
    </div>
    <div class="butOk" onclick="VoP40()">
    Временное разрешение 
    </div>
    <div class="butOk" onclick="VoP41()">
    Точность получения ед.Хаунсфилда 
    </div>
    <div class="butOk" onclick="VoP42()">
    Поглощенная, эквивалентная, эффективная дозы 
    </div>
    <div class="butOk" onclick="VoP43()">
    Изменение дозы от размера среза 
    </div>
    <div class="butOk" onclick="VoP44()">
    Методы снижения лучевой нагрузки 
    </div>
    <br><hr>
    <div id="OTv" class="just noselect">
    Ответ на вопрос билета.
    </div>
    `

    a = a + b;
    document.getElementById("boed1").innerHTML = a;
}